// процес - це є якась виділена память яка використовується нашою прогою, процеси ізольовані
using Lesson;
using System.Diagnostics;
using System.Text;


//LearnProcess.Main();
//LearnDomain.Main();
//LearnReflection.Main();
//ProxyByReflection.Main();

// jit - треба ще докомпілювати
//aot - повністю перетворює в бінарник

//веб сервер - комп де лежать файли сайту. з точки зору по це http сервер - частина по яка розуміє url адреси і http


//kestrel - веб сервер частина стеку технологій ASP.Net він приймає http запити 
//наша прилага це по суті конвеєр обробки запитів а кестрел передає ці запити йому
// через клас HttpContext він передає запити нашому додатку